meeting/minutes/2025/05-27.org
*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-1984][#1984]]: 882 Drop fn:chain
+ PR [[https://qt4cg.org/dashboard/#pr-1894][#1894]]: Additional examples to fn:chain - in a new branch
+ PR [[https://qt4cg.org/dashboard/#pr-2013][#2013]]: 748 Parse functions: consistency
+ PR [[https://qt4cg.org/dashboard/#pr-1959][#1959]]: 1953 (part) XSLT Worked example using methods to implement atomic sets
+ PR [[https://qt4cg.org/dashboard/#pr-2011][#2011]]: 675(part): Add XSLT static typing rules for new kinds of XPath expression
+ PR [[https://qt4cg.org/dashboard/#pr-1942][#1942]]: 37 Support sequence, array, and map destructuring declarations
+ PR [[https://qt4cg.org/dashboard/#pr-1888][#1888]]: 366 xsl:package-location
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array
+ PR [[https://qt4cg.org/dashboard/#pr-2015][#2015]]: 2009 Avoid constructing document node when it makes no sense
+ PR [[https://qt4cg.org/dashboard/#pr-2014][#2014]]: QT4CG-122-01 Add notes, examples, and rationale for xsl:select

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** Review of pull requests
:PROPERTIES:
:CUSTOM_ID: technical-prs
:END:

** What about fn:chain?
:PROPERTIES:
:CUSTOM_ID: fn-chain
:END:

We had a couple of meetings discussing the proposal to replace ~fn:chain~ with
~fn:compose~. The PR for discussion this week simply removes ~fn:chain~. (In
previous straw polls, no one preferred “only fn:chain”; this PR changes the
status quo to reflect that.)

I don’t expect there’s a lot of new technical ground to cover here, so we’ll
attempt to time box the discussion. Ultimately, I hope the CG can express a
clear consensus and that everyone in the minority can accept that consensus.

See PR [[https://qt4cg.org/dashboard/#pr-1984][#1984]]: 882 Drop fn:chain, and PR [[https://qt4cg.org/dashboard/#pr-1894][#1894]]: Additional examples to fn:chain

+ DN: I don’t think that’s correct. I voted for both, that was not a vote against only ~fn:chain~.
+ MK: The PR was a response to the straw poll. People were asked if they wanted
  chain or compose or both or neither. There were various votes, the one that
  came out lowest was ~fn:chain~ only. That’s the status quo, but there was an
  unwillingness to confirm that change. So I’m offering the group the simple
  option of removing it.
+ DN: I would first want to apologies on the issue of the PR that we’ve spent so
  much time on. If we couldn’t decide in four attempts, perhaps the arguments
  against it are unfounded.

DN shares PR #1984 on the screen

+ DN: The arguments against are:
  + … (a) it is more useful to have a function that combines several functions
    into a single function, without actually applying that function to a set of
    supplied arguments
    + … I have shown this isn’t true.
  + … (b) The function has special-case behaviour for arrays (if the input is
    not an array and the function has arity > 1 then the input sequence is
    converted to an array).
    + … Previously, the argument was different.
    + … The ~fn:apply~ function uses an array and has for eight years.
    + … The ~fn:chain~ function is adhering to this principle.
    + … And ~array()~ is the only data type we can use for this.
  + (c) The need for the function is not clearly motivated; the examples given
    can all be achieved in some simpler more intuitive way.
    + … The argument that something is “more intuitive” is very subjective.

DN shows some examples. Starting with this from the spec:

#+BEGIN_SRC
(1 to 5) =!> xs:double() =!> math:sqrt() =!> fn($a) { $a + 1 }() => sum()
#+END_SRC

+ DN: I have a lot of sympathy for the end user who has to read or write this expression.
+ DN: Doing this with ~fn:chain~ is:

#+BEGIN_SRC
let $increment := fn($x) {$x + 1}
return
  chain(1 to 5, (for-each(? chain(? (xs:double#1, math:sqrt#1, $increment))), sum#1)
#+END_SRC

+ DN: This is much more understandable, there’s no repetition of operators.
  Chain is being used to compose a chain of functions. And because chain is also
  a function, it can be used in chain.

Some discussion of getting rid of ~=!>~. We decided not to.

+ JLO: Why would we just drop ~fn:chain~ if we don’t have ~fn:compose~?

NW attempts to explain that the rational is described in the PR and the agenda.

+ JK: I initially supported ~fn:chain~ but I changed my mind. But I don’t find
  his example motivating at all. I think his alternative is about 10% longer
  plus five levels of nesting. 
  + … If that’s the sort of thing you like, you can already do that with a function.
+ DN: It is just a little bit longer because it saves three operators and we
  have an mnemonic name.
+ NW: I find both of these hard to understand.
+ JWL: Because we can’t agree what the signature of a chain/compose function, we
  aren’t going to have any?
+ MK: Yep.
+ JWL: That’s kind of sad. If you want to use arrays, you can do that.
+ MK: A quick observation on the example. My PR raised three points, one about
  it’s special case use of arrays. That’s not needed in this example. And it’s
  better to have something that returns a function instead of applying it.
  That’s why we have partial application in it. That’s why ~fn:compose~ would
  have been better.
+ DN: There are no arrays to be seen here for the user.
  + … The formal definition uses arrays but that doesn’t have anything to do
    with what the user sees.
  + … Besides it’s main use case, ~fn:chain~ also has another use case to do the
    plumbing regardless of the arity of the function in the chain, which
    ~fn:compose~ couldn’t do.
+ CG: I would like to remind us that the numbers of users who will use
  ~fn:chain~ will be very small. Most users don’t use function items at all.
  Most people will find this irrelevant.
+ JLO: The points that MK makes in the PR were the same concerns I had. Users
  who want to do this can.

Proposal: accept the PR.

+ DN: I object. I think people will regret this decision. We still have time to
  fix it.

Accepted over DN’s objection.

