meeting/minutes/2025/05-27.html

<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.3.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1984">#1984</a>: 882 Drop fn:chain</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1894">#1894</a>: Additional examples to fn:chain - in a new branch</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2013">#2013</a>: 748 Parse functions: consistency</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1959">#1959</a>: 1953 (part) XSLT Worked example using methods to implement atomic sets</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2011">#2011</a>: 675(part): Add XSLT static typing rules for new kinds of XPath expression</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1942">#1942</a>: 37 Support sequence, array, and map destructuring declarations</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1888">#1888</a>: 366 xsl:package-location</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2015">#2015</a>: 2009 Avoid constructing document node when it makes no sense</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2014">#2014</a>: QT4CG-122-01 Add notes, examples, and rationale for xsl:select</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-technical-prs" class="outline-3">
<h3 id="technical-prs"><span class="section-number-3">2.1.</span> Review of pull requests</h3>
<div class="outline-text-3" id="text-technical-prs">
</div>
</div>

<div id="outline-container-fn-chain" class="outline-3">
<h3 id="fn-chain"><span class="section-number-3">2.2.</span> What about fn:chain?</h3>
<div class="outline-text-3" id="text-fn-chain">
<p>
We had a couple of meetings discussing the proposal to replace <code>fn:chain</code> with
<code>fn:compose</code>. The PR for discussion this week simply removes <code>fn:chain</code>. (In
previous straw polls, no one preferred “only fn:chain”; this PR changes the
status quo to reflect that.)
</p>

<p>
I don’t expect there’s a lot of new technical ground to cover here, so we’ll
attempt to time box the discussion. Ultimately, I hope the CG can express a
clear consensus and that everyone in the minority can accept that consensus.
</p>

<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1984">#1984</a>: 882 Drop fn:chain, and PR <a href="https://qt4cg.org/dashboard/#pr-1894">#1894</a>: Additional examples to fn:chain
</p>

<ul class="org-ul">
<li>DN: I don’t think that’s correct. I voted for both, that was not a vote against only <code>fn:chain</code>.</li>
<li>MK: The PR was a response to the straw poll. People were asked if they wanted
chain or compose or both or neither. There were various votes, the one that
came out lowest was <code>fn:chain</code> only. That’s the status quo, but there was an
unwillingness to confirm that change. So I’m offering the group the simple
option of removing it.</li>
<li>DN: I would first want to apologies on the issue of the PR that we’ve spent so
much time on. If we couldn’t decide in four attempts, perhaps the arguments
against it are unfounded.</li>
</ul>

<p>
DN shares PR #1984 on the screen
</p>

<ul class="org-ul">
<li>DN: The arguments against are:
<ul class="org-ul">
<li>… (a) it is more useful to have a function that combines several functions
into a single function, without actually applying that function to a set of
supplied arguments
<ul class="org-ul">
<li>… I have shown this isn’t true.</li>
</ul></li>
<li>… (b) The function has special-case behaviour for arrays (if the input is
not an array and the function has arity &gt; 1 then the input sequence is
converted to an array).
<ul class="org-ul">
<li>… Previously, the argument was different.</li>
<li>… The <code>fn:apply</code> function uses an array and has for eight years.</li>
<li>… The <code>fn:chain</code> function is adhering to this principle.</li>
<li>… And <code>array()</code> is the only data type we can use for this.</li>
</ul></li>
<li>(c) The need for the function is not clearly motivated; the examples given
can all be achieved in some simpler more intuitive way.
<ul class="org-ul">
<li>… The argument that something is “more intuitive” is very subjective.</li>
</ul></li>
</ul></li>
</ul>

<p>
DN shows some examples. Starting with this from the spec:
</p>

<pre class="example">
(1 to 5) =!&gt; xs:double() =!&gt; math:sqrt() =!&gt; fn($a) { $a + 1 }() =&gt; sum()
</pre>

<ul class="org-ul">
<li>DN: I have a lot of sympathy for the end user who has to read or write this expression.</li>
<li>DN: Doing this with <code>fn:chain</code> is:</li>
</ul>

<pre class="example">
let $increment := fn($x) {$x + 1}
return
  chain(1 to 5, (for-each(? chain(? (xs:double#1, math:sqrt#1, $increment))), sum#1)
</pre>

<ul class="org-ul">
<li>DN: This is much more understandable, there’s no repetition of operators.
Chain is being used to compose a chain of functions. And because chain is also
a function, it can be used in chain.</li>
</ul>

<p>
Some discussion of getting rid of <code>=!&gt;</code>. We decided not to.
</p>

<ul class="org-ul">
<li>JLO: Why would we just drop <code>fn:chain</code> if we don’t have <code>fn:compose</code>?</li>
</ul>

<p>
NW attempts to explain that the rational is described in the PR and the agenda.
</p>

<ul class="org-ul">
<li>JK: I initially supported <code>fn:chain</code> but I changed my mind. But I don’t find
his example motivating at all. I think his alternative is about 10% longer
plus five levels of nesting. 
<ul class="org-ul">
<li>… If that’s the sort of thing you like, you can already do that with a function.</li>
</ul></li>
<li>DN: It is just a little bit longer because it saves three operators and we
have an mnemonic name.</li>
<li>NW: I find both of these hard to understand.</li>
<li>JWL: Because we can’t agree what the signature of a chain/compose function, we
aren’t going to have any?</li>
<li>MK: Yep.</li>
<li>JWL: That’s kind of sad. If you want to use arrays, you can do that.</li>
<li>MK: A quick observation on the example. My PR raised three points, one about
it’s special case use of arrays. That’s not needed in this example. And it’s
better to have something that returns a function instead of applying it.
That’s why we have partial application in it. That’s why <code>fn:compose</code> would
have been better.</li>
<li>DN: There are no arrays to be seen here for the user.
<ul class="org-ul">
<li>… The formal definition uses arrays but that doesn’t have anything to do
with what the user sees.</li>
<li>… Besides it’s main use case, <code>fn:chain</code> also has another use case to do the
plumbing regardless of the arity of the function in the chain, which
<code>fn:compose</code> couldn’t do.</li>
</ul></li>
<li>CG: I would like to remind us that the numbers of users who will use
<code>fn:chain</code> will be very small. Most users don’t use function items at all.
Most people will find this irrelevant.</li>
<li>JLO: The points that MK makes in the PR were the same concerns I had. Users
who want to do this can.</li>
</ul>

<p>
Proposal: accept the PR.
</p>

<ul class="org-ul">
<li>DN: I object. I think people will regret this decision. We still have time to
fix it.</li>
</ul>

<p>
Accepted over DN’s objection.
</p>
</div>
</div>
