meeting/minutes/2025/05-27.org
** PR #1959: 1953 (part) XSLT Worked example using methods to implement atomic sets
:PROPERTIES:
:CUSTOM_ID: pr-1959
:END:
See  PR [[https://qt4cg.org/dashboard/#pr-1959][#1959]]

+ MK: The PR still needs a worked example in XQuery. I don’t want to close this until we have.

MK walks thorugh the PR in XSLT.

+ MK: I’ve add an option to not construct an implicit constructor from the record type.
  + … Skipping the editorial work of fixing the description of a binary tree.

MK reviews the example in 5.3.3. Example: Defining an Atomic Set.

+ MK: It’s interesting that we get a prose description, then a field definition
  that describes the API, then we get the function definitions. We might want to
  try to do better.
  + … There’s a field we’d like to make private, but we can’t, so I named it
    with a leading “_”.
+ JWL: This would be just as easy to put this in as a map in XPath, wouldn’t it?
+ MK: Yes.
+ JWL: This may be an example of a case where using a record doesn’t really help.
+ MK: I experimented with various ways, and I agree that ~xsl:record~ doesn’t add that much.
+ JLO: That’s a complex example that uses “.” in record methods.
  + … Is this meant as an example of the record in XSLT?
+ MK: You don’t have to use ~xsl:record~. You could replace it with ~xsl:map~ or
  with an XPath expression that uses a map constructor.

Some discussion of the use of ~%method~ in or out of a map or record. MK: there
are several options.

+ JLO: Using “_” for a semi-private method reminds of JavaScript in the old days.
  + … I would really like to see the merging of the human and machine readable documentation part.
+ MK: Yes, one disadvantage of using ~xsl:record~ is that we can’t do that, but
  we could with ~xsl:map~. That might look better.
  + … I’m not sure the XPath way would work any better; the documentation would be in comments.
+ DN: This demonstrates the high power we have with methods in records. We’ve
  also had for more than two years to have a set data type. This demonstration
  shows that there are no significant obstacles to doing it.
+ JWL: To Mike’s point about the documentation, we’ve added ~xsl:note~. We could
  also add an attribute flavor an ~@xsl:note~ attribute.
+ MK: Yes, but you couldn’t have structured text in there.
+ RD: Looking at the definition of ~xsl:note~, that says it can appear anywhere. So should that
  be updated?
+ MK: The problem is the list of attributes in the definition.

Proposal: accept this PR.

Accepted.

ACTION: QT4CG-123-01: MK to do the set example in XQuery.

** PR #2013: 748 Parse functions: consistency
:PROPERTIES:
:CUSTOM_ID: pr-2013
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2013][#2013]]

CG reviews the PR.

+ CG: We’ve added ~parse-html~ and ~json-doc~ and ~parse-json~ and ~doc~. There
  are inconsistencies between them I’d I’ve tried to align them. And I’ve added document
  functions for CSV.
  + ~fn:parse-xml~: Basically the same as before but you can specify binary input.
    + … There were questions about this. But there are cases where binary input
      comes in.
    + … You can manage that by writing to disk and loading the file, but this is easier.
    + … I think the same arguments apply to ~fn:parse-html~.
    + … The encoding may be embedded in the binary, so you can’t just convert it
      to a string first.
    + … Mostly the rules have been extended a little. My description of how
      encoding is detected is a bit vague, but it should be more similar to
      ~fn:doc~. But that function doesn’t give much detail either. All that
      ~fn:doc~ says is that the data is “parsed as XML”.
+ RD: Could we express ~fn:doc~ in terms of ~fn:parse-xml~?
+ CG: Maybe we could. In many cases ~fn:doc~ depends on the implementation.

RD sketches out how it might be possible.

+ MK: All the material we have that talks about the dynamic context having a
  mapping from URIs to resources is something that it would be nice to unify
  across these functions.
+ CG: Right.
+ RD: Or maybe we could talk about parsing them into a string.
+ MK: It’d be nice to say that the functions are the composition of three
  functions: getting a resource from a URI, turning a binary into a string, and
  the parsing a string.
+ RD: Or have those as separate sections.
+ CG: ~fn:parse-xml-fragment~ is similar.
+ CG: ~fn:html-doc~ is new, it’s an alignment with JSON doc mostly
  + … That description uses some composition.
+ CG: We allow binary input to for JSON, similarly, and we add a ~fn:csv-doc~ function.
+ CG: I haven’t added binary flavors of CSV parsing, but those are all
  accessible in the XPath. We don’t need to serialize those.
+ JWL: Brave to change the ~fn:doc~ function given it’s been around for twenty years!
+ JK: The one thing I don’t like about allowing binary in ~fn:parse-xml~, I want to
  be forced to use another function and keep ~fn:parse-xml()~ simple.
  + … Are there really use cases to motivate this?
+ RD: The use case is, if you have a blob of binary data, detecting the encoding
  of XML and HTML is complicated. You have to deal with byte order, etc.
+ JK: I understand, but why are we putting this in ~fn:parse-xml~ instead of
  some sort of handler function.
+ CG: What’s the alternative?
+ JK: I’m not proposing one, but I think this muddies the water. If I
  accidentally send binary data to ~fn:parse-xml()~, I want an error to be raised.

Some discussion of parsing UTF 8 or parsing binary XML.

+ RD: With XML and HTML parsers, they accept binary data. So having binary data
  as an option to these functions let’s you pass the data straight through to
  those parsers without preprocessing. But I wouldn’t object to separate functions.
+ JLO: I am a fan of opening this up. It will allow streaming parsing. I was
  wondering if the use of new functions (~html-doc~ and ~csv-doc~) that are
  expressed in terms of unparsed text. Is that good enough?
  + Could ~parse-csv~ use binary; then it gets muddy.
+ CG: Maybe a “parse binary” option would be good.
+ JLO: I’d like to add an option to specify the parser to ~fn:doc()~!
+ MK: I think the reasons that the specifications wind up being muddy is that
  the three operations I described aren’t as independent of each other as we
  might like. In particular, the encoding detection is done on the fly by the
  parser.
  + … But I think CG’s proposal is going in the right direction. I think it
    should just be more explicit that the decoding is delegated to the relevant
    spec.

Some discussion of whether to accept it or not. 

We’ll look again in two weeks.

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

+ JK: I’ve made a couple of pull requests to the XSLT test suite?
+ MK: I’ll take a look. I look occasionally.

* Adjourned
:PROPERTIES:
:CUSTOM_ID: adjourned
:END:
