meeting/minutes/2025/05-27.html

<div id="outline-container-pr-1959" class="outline-3">
<h3 id="pr-1959"><span class="section-number-3">2.3.</span> PR #1959: 1953 (part) XSLT Worked example using methods to implement atomic sets</h3>
<div class="outline-text-3" id="text-pr-1959">
<p>
See  PR <a href="https://qt4cg.org/dashboard/#pr-1959">#1959</a>
</p>

<ul class="org-ul">
<li>MK: The PR still needs a worked example in XQuery. I don’t want to close this until we have.</li>
</ul>

<p>
MK walks thorugh the PR in XSLT.
</p>

<ul class="org-ul">
<li>MK: I’ve add an option to not construct an implicit constructor from the record type.
<ul class="org-ul">
<li>… Skipping the editorial work of fixing the description of a binary tree.</li>
</ul></li>
</ul>

<p>
MK reviews the example in 5.3.3. Example: Defining an Atomic Set.
</p>

<ul class="org-ul">
<li>MK: It’s interesting that we get a prose description, then a field definition
that describes the API, then we get the function definitions. We might want to
try to do better.
<ul class="org-ul">
<li>… There’s a field we’d like to make private, but we can’t, so I named it
with a leading “_”.</li>
</ul></li>
<li>JWL: This would be just as easy to put this in as a map in XPath, wouldn’t it?</li>
<li>MK: Yes.</li>
<li>JWL: This may be an example of a case where using a record doesn’t really help.</li>
<li>MK: I experimented with various ways, and I agree that <code>xsl:record</code> doesn’t add that much.</li>
<li>JLO: That’s a complex example that uses “.” in record methods.
<ul class="org-ul">
<li>… Is this meant as an example of the record in XSLT?</li>
</ul></li>
<li>MK: You don’t have to use <code>xsl:record</code>. You could replace it with <code>xsl:map</code> or
with an XPath expression that uses a map constructor.</li>
</ul>

<p>
Some discussion of the use of <code>%method</code> in or out of a map or record. MK: there
are several options.
</p>

<ul class="org-ul">
<li>JLO: Using “_” for a semi-private method reminds of JavaScript in the old days.
<ul class="org-ul">
<li>… I would really like to see the merging of the human and machine readable documentation part.</li>
</ul></li>
<li>MK: Yes, one disadvantage of using <code>xsl:record</code> is that we can’t do that, but
we could with <code>xsl:map</code>. That might look better.
<ul class="org-ul">
<li>… I’m not sure the XPath way would work any better; the documentation would be in comments.</li>
</ul></li>
<li>DN: This demonstrates the high power we have with methods in records. We’ve
also had for more than two years to have a set data type. This demonstration
shows that there are no significant obstacles to doing it.</li>
<li>JWL: To Mike’s point about the documentation, we’ve added <code>xsl:note</code>. We could
also add an attribute flavor an <code>@xsl:note</code> attribute.</li>
<li>MK: Yes, but you couldn’t have structured text in there.</li>
<li>RD: Looking at the definition of <code>xsl:note</code>, that says it can appear anywhere. So should that
be updated?</li>
<li>MK: The problem is the list of attributes in the definition.</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>

<p>
ACTION: QT4CG-123-01: MK to do the set example in XQuery.
</p>
</div>
</div>

<div id="outline-container-pr-2013" class="outline-3">
<h3 id="pr-2013"><span class="section-number-3">2.4.</span> PR #2013: 748 Parse functions: consistency</h3>
<div class="outline-text-3" id="text-pr-2013">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2013">#2013</a>
</p>

<p>
CG reviews the PR.
</p>

<ul class="org-ul">
<li>CG: We’ve added <code>parse-html</code> and <code>json-doc</code> and <code>parse-json</code> and <code>doc</code>. There
are inconsistencies between them I’d I’ve tried to align them. And I’ve added document
functions for CSV.
<ul class="org-ul">
<li><code>fn:parse-xml</code>: Basically the same as before but you can specify binary input.
<ul class="org-ul">
<li>… There were questions about this. But there are cases where binary input
comes in.</li>
<li>… You can manage that by writing to disk and loading the file, but this is easier.</li>
<li>… I think the same arguments apply to <code>fn:parse-html</code>.</li>
<li>… The encoding may be embedded in the binary, so you can’t just convert it
to a string first.</li>
<li>… Mostly the rules have been extended a little. My description of how
encoding is detected is a bit vague, but it should be more similar to
<code>fn:doc</code>. But that function doesn’t give much detail either. All that
<code>fn:doc</code> says is that the data is “parsed as XML”.</li>
</ul></li>
</ul></li>
<li>RD: Could we express <code>fn:doc</code> in terms of <code>fn:parse-xml</code>?</li>
<li>CG: Maybe we could. In many cases <code>fn:doc</code> depends on the implementation.</li>
</ul>

<p>
RD sketches out how it might be possible.
</p>

<ul class="org-ul">
<li>MK: All the material we have that talks about the dynamic context having a
mapping from URIs to resources is something that it would be nice to unify
across these functions.</li>
<li>CG: Right.</li>
<li>RD: Or maybe we could talk about parsing them into a string.</li>
<li>MK: It’d be nice to say that the functions are the composition of three
functions: getting a resource from a URI, turning a binary into a string, and
the parsing a string.</li>
<li>RD: Or have those as separate sections.</li>
<li>CG: <code>fn:parse-xml-fragment</code> is similar.</li>
<li>CG: <code>fn:html-doc</code> is new, it’s an alignment with JSON doc mostly
<ul class="org-ul">
<li>… That description uses some composition.</li>
</ul></li>
<li>CG: We allow binary input to for JSON, similarly, and we add a <code>fn:csv-doc</code> function.</li>
<li>CG: I haven’t added binary flavors of CSV parsing, but those are all
accessible in the XPath. We don’t need to serialize those.</li>
<li>JWL: Brave to change the <code>fn:doc</code> function given it’s been around for twenty years!</li>
<li>JK: The one thing I don’t like about allowing binary in <code>fn:parse-xml</code>, I want to
be forced to use another function and keep <code>fn:parse-xml()</code> simple.
<ul class="org-ul">
<li>… Are there really use cases to motivate this?</li>
</ul></li>
<li>RD: The use case is, if you have a blob of binary data, detecting the encoding
of XML and HTML is complicated. You have to deal with byte order, etc.</li>
<li>JK: I understand, but why are we putting this in <code>fn:parse-xml</code> instead of
some sort of handler function.</li>
<li>CG: What’s the alternative?</li>
<li>JK: I’m not proposing one, but I think this muddies the water. If I
accidentally send binary data to <code>fn:parse-xml()</code>, I want an error to be raised.</li>
</ul>

<p>
Some discussion of parsing UTF 8 or parsing binary XML.
</p>

<ul class="org-ul">
<li>RD: With XML and HTML parsers, they accept binary data. So having binary data
as an option to these functions let’s you pass the data straight through to
those parsers without preprocessing. But I wouldn’t object to separate functions.</li>
<li>JLO: I am a fan of opening this up. It will allow streaming parsing. I was
wondering if the use of new functions (<code>html-doc</code> and <code>csv-doc</code>) that are
expressed in terms of unparsed text. Is that good enough?
<ul class="org-ul">
<li>Could <code>parse-csv</code> use binary; then it gets muddy.</li>
</ul></li>
<li>CG: Maybe a “parse binary” option would be good.</li>
<li>JWL: I’d like to add an option to specify the parser to <code>fn:doc()</code>!</li>
<li>MK: I think the reasons that the specifications wind up being muddy is that
the three operations I described aren’t as independent of each other as we
might like. In particular, the encoding detection is done on the fly by the
parser.
<ul class="org-ul">
<li>… But I think CG’s proposal is going in the right direction. I think it
should just be more explicit that the decoding is delegated to the relevant
spec.</li>
</ul></li>
</ul>

<p>
Some discussion of whether to accept it or not. 
</p>

<p>
We’ll look again in two weeks.
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<ul class="org-ul">
<li>JK: I’ve made a couple of pull requests to the XSLT test suite?</li>
<li>MK: I’ll take a look. I look occasionally.</li>
</ul>
</div>
</div>

<div id="outline-container-adjourned" class="outline-2">
<h2 id="adjourned"><span class="section-number-2">4.</span> Adjourned</h2>
<div class="outline-text-2" id="text-adjourned">
</div>
</div>
</div>
</body>
</html>
